from bn_rule_based_stemmer import *
sentence = "চট্টগ্রাম বিশ্ববিদ্যালয়ে ছাত্রলীগের অভ্যন্তরীণ বিরোধের জের ধরে ত্রিপক্ষীয় সংঘর্ষে দুই হলের ৮০টিরও বেশি কক্ষ ভাঙচুরের ঘটনা ঘটেছে বুধবার গভীর রাতে টানা দু ঘণ্টা ধরে চলা এ সংঘর্ষে পক্ষে-বিপক্ষের ৪৩ নেতা-কর্মী আহত হয়েছে পরে পুলিশ এসে পরিস্থিতি নিয়ন্ত্রণ করে এ ঘটনায় হল দুটি থেকে ৫৯ জনকে পুলিশ আটক করলেও শেষ পর্যন্ত ৭ জনকে হাটহাজারী থানায় নিয়ে গেছে সেখানে তাদের আটক দেখানো হয়েছে এদিকে সংঘর্ষ থামলেও  আজ বৃহস্পতিবারও (৫ মার্চ) ক্যাম্পাসে উভয়পক্ষের মধ্যে এখনও চাপা উত্তেজনা বিরাজ করছে হলের সাধারণ শিক্ষার্থীরা প্রচণ্ড আতঙ্কের মধ্যে রয়েছেন বিবদমান পক্ষগুলোকে নিয়ে সমাধানের জন্য রাতেই বৈঠকে বসছেন উপাচার্য অধ্যাপক ড. শিরীণ আখতার"
words = sentence.split(" ")
result = {}
stemmer = BengaliStemmer()
for word in words:
    print(word)
    try:
        root = stemmer.findStem(word)
        result[word] = root
    except Exception as err:
        print(err)